# Найти сумму чисел ряда 1,2,3,...,60 с использованием функции нахождения суммы.
# Использовать локальные переменные.
 A=1 #присваивание переменной чесло
 B=1 #присваивание переменной чесло
 while A!=61: #цикл с условием
     A+=1 #прибавление к переменной 1
     B=B+A #присваивание переменной итог выражения
 print(B) #вывод переменной В
